RT-Thread/rt-thread/bsp/nuvoton/libraries/m480/rtt_port/drv_crypto.c
/**************************************************************************//**
*
* @copyright (C) 2020 Nuvoton Technology Corp. All rights reserved.
*
* SPDX-License-Identifier: Apache-2.0
*
* Change Logs:
* Date            Author         Notes
* 2020-3-3        CHChen         First version
* 2020-5-3        YCHuang12      Add TDES and SHA
*
******************************************************************************/

#include <rtconfig.h>

#if ((defined(BSP_USING_CRYPTO) || defined(BSP_USING_TRNG) || defined(BSP_USING_CRC)) && defined(RT_USING_HWCRYPTO))

#include <rtdevice.h>
#include <rtdbg.h>
#include <board.h>
#include "NuMicro.h"
#include <nu_bitutil.h>

#if defined(BSP_USING_TRNG)
    #include "drv_trng.h"
#endif

#if defined(BSP_USING_CRC)
    #include "drv_crc.h"
#endif

/* Private typedef --------------------------------------------------------------*/

typedef struct
{
    uint8_t *pu8SHATempBuf;
    uint32_t u32SHATempBufLen;
    uint32_t u32DMAMode;
    uint32_t u32BlockSize;
} S_SHA_CONTEXT;

/* Private functions ------------------------------------------------------------*/
static rt_err_t nu_hwcrypto_create(struct rt_hwcrypto_ctx *ctx);
static void nu_hwcrypto_destroy(struct rt_hwcrypto_ctx *ctx);
static rt_err_t nu_hwcrypto_clone(struct rt_hwcrypto_ctx *des, const struct rt_hwcrypto_ctx *src);
static void nu_hwcrypto_reset(struct rt_hwcrypto_ctx *ctx);

/* Private variables ------------------------------------------------------------*/
static const struct rt_hwcrypto_ops nu_hwcrypto_ops =
{
    .create = nu_hwcrypto_create,
    .destroy = nu_hwcrypto_destroy,
    .copy = nu_hwcrypto_clone,
    .reset = nu_hwcrypto_reset,
};

/* Crypto engine operation ------------------------------------------------------------*/
#if defined(BSP_USING_CRYPTO)

#define NU_HWCRYPTO_DES_3KEYS    1
#define NU_HWCRYPTO_DES_NO3KEYS  0
#define NU_HWCRYPTO_AES_NAME    "nu_AES"
#define NU_HWCRYPTO_TDES_NAME   "nu_TDES"
#define NU_HWCRYPTO_SHA_NAME    "nu_SHA"
#if !defined(BSP_USING_TRNG)
    #define NU_HWCRYPTO_PRNG_NAME   "nu_PRNG"
#endif

static struct rt_mutex s_AES_mutex;
static struct rt_mutex s_TDES_mutex;
static struct rt_mutex s_SHA_mutex;

#if !defined(BSP_USING_TRNG)
    static struct rt_mutex s_PRNG_mutex;
    static volatile int s_PRNG_done;
#endif

static volatile int s_AES_done;
static volatile int s_TDES_done;
static volatile int s_SHA_done;

static rt_err_t nu_crypto_init(void)
{
    rt_err_t result;

    /* Enable Crypto engine interrupt */
    NVIC_EnableIRQ(CRPT_IRQn);

    AES_ENABLE_INT(CRPT);
    TDES_ENABLE_INT(CRPT);
    SHA_ENABLE_INT(CRPT);

    //init cipher mutex
    result = rt_mutex_init(&s_AES_mutex, NU_HWCRYPTO_AES_NAME, RT_IPC_FLAG_FIFO);
    RT_ASSERT(result == RT_EOK);

    result = rt_mutex_init(&s_TDES_mutex, NU_HWCRYPTO_TDES_NAME, RT_IPC_FLAG_FIFO);
    RT_ASSERT(result == RT_EOK);

    result = rt_mutex_init(&s_SHA_mutex, NU_HWCRYPTO_SHA_NAME, RT_IPC_FLAG_FIFO);
    RT_ASSERT(result == RT_EOK);

#if !defined(BSP_USING_TRNG)
    PRNG_ENABLE_INT(CRPT);
    result = rt_mutex_init(&s_PRNG_mutex, NU_HWCRYPTO_PRNG_NAME, RT_IPC_FLAG_FIFO);
    RT_ASSERT(result == RT_EOK);
#endif

    return RT_EOK;
}

//Crypto engine IRQ handler

void CRYPTO_IRQHandler()
{
    if (AES_GET_INT_FLAG(CRPT))
    {
        if (CRPT->INTSTS & (CRPT_INTSTS_AESEIF_Msk) || (CRPT->AES_STS & (CRPT_AES_STS_BUSERR_Msk | CRPT_AES_STS_CNTERR_Msk | (0x1ul << 21))))
            rt_kprintf("AES ERROR\n");
        s_AES_done = 1;
        AES_CLR_INT_FLAG(CRPT);
    }

    if (TDES_GET_INT_FLAG(CRPT))
    {
        s_TDES_done = 1;
        TDES_CLR_INT_FLAG(CRPT);
    }

    if (SHA_GET_INT_FLAG(CRPT))
    {
        if (CRPT->INTSTS & (CRPT_INTSTS_HMACEIF_Msk) || (CRPT->HMAC_STS & (CRPT_HMAC_STS_DMAERR_Msk | (0x1ul << 9))))
            rt_kprintf("SHA ERROR\n");
        s_SHA_done = 1;
        SHA_CLR_INT_FLAG(CRPT);
    }

#if !defined(BSP_USING_TRNG)
    if (PRNG_GET_INT_FLAG(CRPT))
    {
        s_PRNG_done = 1;
        PRNG_CLR_INT_FLAG(CRPT);
    }
#endif
}

static rt_err_t nu_aes_crypt_run(
    rt_bool_t bEncrypt,
    uint32_t u32OpMode,
    uint8_t *pu8Key,
    uint32_t u32KeySize,
    uint8_t *pu8IV,
    uint8_t *pu8InData,
    uint8_t *pu8OutData,
    uint32_t u32DataLen
)
{
    rt_err_t result;

    uint32_t au32SwapKey[8];
    uint32_t au32SwapIV[4];

    au32SwapKey[0] = nu_get32_be(&pu8Key[0]);
    au32SwapKey[1] = nu_get32_be(&pu8Key[4]);
    au32SwapKey[2] = nu_get32_be(&pu8Key[8]);
    au32SwapKey[3] = nu_get32_be(&pu8Key[12]);

    if ((u32KeySize == AES_KEY_SIZE_192) || (u32KeySize == AES_KEY_SIZE_256))
    {
        au32SwapKey[4] = nu_get32_be(&pu8Key[16]);
        au32SwapKey[5] = nu_get32_be(&pu8Key[20]);
    }

    if (u32KeySize == AES_KEY_SIZE_256)
    {
        au32SwapKey[6] = nu_get32_be(&pu8Key[24]);
        au32SwapKey[7] = nu_get32_be(&pu8Key[28]);
    }

    au32SwapIV[0] = nu_get32_be(&pu8IV[0]);
    au32SwapIV[1] = nu_get32_be(&pu8IV[4]);
    au32SwapIV[2] = nu_get32_be(&pu8IV[8]);
    au32SwapIV[3] = nu_get32_be(&pu8IV[12]);

    result = rt_mutex_take(&s_AES_mutex, RT_WAITING_FOREVER);
    RT_ASSERT(result == RT_EOK);

    //Using Channel 0
    AES_Open(CRPT, 0, bEncrypt, u32OpMode, u32KeySize, AES_IN_OUT_SWAP);
    AES_SetKey(CRPT, 0, (uint32_t *)au32SwapKey, u32KeySize);
    AES_SetInitVect(CRPT, 0, (uint32_t *)au32SwapIV);

    //Setup AES DMA
    AES_SetDMATransfer(CRPT, 0, (uint32_t)pu8InData, (uint32_t)pu8OutData, u32DataLen);
    AES_CLR_INT_FLAG(CRPT);
    //Start AES encryption/decryption
    s_AES_done = 0;
    AES_Start(CRPT, 0, CRYPTO_DMA_ONE_SHOT);
    while (!s_AES_done) {};

    result = rt_mutex_release(&s_AES_mutex);
    RT_ASSERT(result == RT_EOK);

    return RT_EOK;
}

#if !defined(BSP_USING_TRNG)
//Using PRNG instead of TRNG
static void nu_prng_open(uint32_t u32Seed)
{
    rt_err_t result;

    result = rt_mutex_take(&s_PRNG_mutex, RT_WAITING_FOREVER);
    RT_ASSERT(result == RT_EOK);

    //Open PRNG 64 bits. But always return 32 bits
    PRNG_Open(CRPT, PRNG_KEY_SIZE_64, PRNG_SEED_RELOAD, u32Seed);

    result = rt_mutex_release(&s_PRNG_mutex);
    RT_ASSERT(result == RT_EOK);

