RT-Thread/rt-thread/bsp/nuvoton/libraries/m480/rtt_port/drv_crypto.c
}

static rt_uint32_t nu_prng_run(void)
{
    rt_err_t result;
    uint32_t au32RNGValue[2];

    result = rt_mutex_take(&s_PRNG_mutex, RT_WAITING_FOREVER);
    RT_ASSERT(result == RT_EOK);

    s_PRNG_done = 0;
    PRNG_Start(CRPT);
    while (!s_PRNG_done) {};

    PRNG_Read(CRPT, au32RNGValue);

    result = rt_mutex_release(&s_PRNG_mutex);
    RT_ASSERT(result == RT_EOK);

    return au32RNGValue[0];
}

#endif

static rt_err_t nu_aes_crypt(struct hwcrypto_symmetric *symmetric_ctx, struct hwcrypto_symmetric_info *symmetric_info)
{
    uint32_t u32AESOpMode;
    uint32_t u32AESKeySize;
    unsigned char *in, *out;
    unsigned char in_align_flag = 0;
    unsigned char out_align_flag = 0;
    unsigned char iv_temp[16];

    if ((symmetric_info->length % 4) != 0)
    {
        return -RT_EINVAL;
    }

    //Checking key length
    if (symmetric_ctx->key_bitlen == 128)
    {
        u32AESKeySize = AES_KEY_SIZE_128;
    }
    else if (symmetric_ctx->key_bitlen == 192)
    {
        u32AESKeySize = AES_KEY_SIZE_192;
    }
    else if (symmetric_ctx->key_bitlen == 256)
    {
        u32AESKeySize = AES_KEY_SIZE_256;
    }
    else
    {
        return -RT_EINVAL;
    }

    //Select AES operation mode
    switch (symmetric_ctx->parent.type & (HWCRYPTO_MAIN_TYPE_MASK | HWCRYPTO_SUB_TYPE_MASK))
    {
    case HWCRYPTO_TYPE_AES_ECB:
        u32AESOpMode = AES_MODE_ECB;
        break;
    case HWCRYPTO_TYPE_AES_CBC:
        u32AESOpMode = AES_MODE_CBC;
        break;
    case HWCRYPTO_TYPE_AES_CFB:
        u32AESOpMode = AES_MODE_CFB;
        break;
    case HWCRYPTO_TYPE_AES_OFB:
        u32AESOpMode = AES_MODE_OFB;
        break;
    case HWCRYPTO_TYPE_AES_CTR:
        u32AESOpMode = AES_MODE_CTR;
        break;
    default :
        return -RT_ERROR;
    }

    in = (unsigned char *)symmetric_info->in;
    out = (unsigned char *)symmetric_info->out;

    //Checking in/out data buffer address not alignment or out of SRAM
    if (((rt_uint32_t)in % 4) != 0 || ((rt_uint32_t)in < SRAM_BASE) || ((rt_uint32_t)in > SRAM_END))
    {
        in = rt_malloc(symmetric_info->length);
        if (in == RT_NULL)
        {
            LOG_E("fun[%s] memory allocate %d bytes failed!", __FUNCTION__, symmetric_info->length);
            return -RT_ENOMEM;
        }

        rt_memcpy(in, symmetric_info->in, symmetric_info->length);
        in_align_flag = 1;
    }

    if (((rt_uint32_t)out % 4) != 0 || ((rt_uint32_t)out < SRAM_BASE) || ((rt_uint32_t)out > SRAM_END))
    {
        out = rt_malloc(symmetric_info->length);
        if (out == RT_NULL)
        {
            if (in_align_flag)
                rt_free(in);
            LOG_E("fun[%s] memory allocate %d bytes failed!", __FUNCTION__, symmetric_info->length);
            return -RT_ENOMEM;
        }

        out_align_flag = 1;
    }

    if ((u32AESOpMode == AES_MODE_CBC) && (symmetric_info->mode == HWCRYPTO_MODE_DECRYPT))
    {
        uint32_t loop;

        loop = (symmetric_info->length - 1) / 16;
        rt_memcpy(iv_temp, in + (loop * 16), 16);
    }

    nu_aes_crypt_run(symmetric_info->mode == HWCRYPTO_MODE_ENCRYPT ? TRUE : FALSE, u32AESOpMode, symmetric_ctx->key, u32AESKeySize, symmetric_ctx->iv, in, out, symmetric_info->length);

    if (u32AESOpMode == AES_MODE_CBC)
    {
        if (symmetric_info->mode == HWCRYPTO_MODE_DECRYPT)
        {
            rt_memcpy(symmetric_ctx->iv, iv_temp, 16);
        }
        else
        {
            uint32_t loop;

            loop = (symmetric_info->length - 1) / 16;
            rt_memcpy(symmetric_ctx->iv, out + (loop * 16), 16);
        }
    }

    if (out_align_flag)
    {
        rt_memcpy(symmetric_info->out, out, symmetric_info->length);
        rt_free(out);
    }

    if (in_align_flag)
    {
        rt_free(in);
    }

    return RT_EOK;
}

static rt_err_t nu_des_crypt_run(
    rt_bool_t bEncrypt,
    uint32_t u32OpMode,
    uint8_t *pu8Key,
    uint32_t u32KeySize,
    uint8_t *pu8IV,
    uint8_t *pu8InData,
    uint8_t *pu8OutData,
    uint32_t u32DataLen
)
{
    rt_err_t result;

    uint32_t au32SwapKey[3][2];
    uint32_t au32SwapIV[2];

    au32SwapKey[0][0] = nu_get32_be(&pu8Key[0]);
    au32SwapKey[0][1] = nu_get32_be(&pu8Key[4]);
    au32SwapKey[1][0] = nu_get32_be(&pu8Key[8]);
    au32SwapKey[1][1] = nu_get32_be(&pu8Key[12]);

    if (u32KeySize == NU_HWCRYPTO_DES_3KEYS)
    {
        au32SwapKey[2][0] = nu_get32_be(&pu8Key[16]);
        au32SwapKey[2][1] = nu_get32_be(&pu8Key[20]);
    }

    au32SwapIV[0] = nu_get32_be(&pu8IV[0]);
    au32SwapIV[1] = nu_get32_be(&pu8IV[4]);

    result = rt_mutex_take(&s_TDES_mutex, RT_WAITING_FOREVER);
    RT_ASSERT(result == RT_EOK);

    //Using Channel 0
    TDES_Open(CRPT, 0, bEncrypt, (u32OpMode & CRPT_TDES_CTL_TMODE_Msk), u32KeySize, u32OpMode, TDES_IN_OUT_WHL_SWAP);
    TDES_SetKey(CRPT, 0, au32SwapKey);
    TDES_SetInitVect(CRPT, 0, au32SwapIV[0], au32SwapIV[1]);

    //Setup TDES DMA
    TDES_SetDMATransfer(CRPT, 0, (uint32_t)pu8InData, (uint32_t)pu8OutData, u32DataLen);
    TDES_CLR_INT_FLAG(CRPT);
    //Start TDES encryption/decryption
    s_TDES_done = 0;
    TDES_Start(CRPT, 0, CRYPTO_DMA_ONE_SHOT);
    while (!s_TDES_done) {};

    result = rt_mutex_release(&s_TDES_mutex);
    RT_ASSERT(result == RT_EOK);

    return RT_EOK;
}

static rt_err_t nu_des_crypt(struct hwcrypto_symmetric *symmetric_ctx, struct hwcrypto_symmetric_info *symmetric_info)
{
    uint32_t u32DESOpMode;
    uint32_t u32DESKeySize;
    unsigned char *in, *out;
    unsigned char in_align_flag = 0;
    unsigned char out_align_flag = 0;

    if ((symmetric_info->length % 8) != 0)
    {
        return -RT_EINVAL;
    }

    //Checking key length
    if (symmetric_ctx->key_bitlen == 128 || symmetric_ctx->key_bitlen == 64)
    {
        u32DESKeySize = NU_HWCRYPTO_DES_NO3KEYS;
    }
    else if (symmetric_ctx->key_bitlen == 192)
    {
        u32DESKeySize = NU_HWCRYPTO_DES_3KEYS;
    }
    else
    {
        return -RT_EINVAL;
    }

    //Select DES operation mode
    switch (symmetric_ctx->parent.type & (HWCRYPTO_MAIN_TYPE_MASK | HWCRYPTO_SUB_TYPE_MASK))
    {
    case HWCRYPTO_TYPE_DES_ECB:
        u32DESOpMode = DES_MODE_ECB;
        break;
    case HWCRYPTO_TYPE_DES_CBC:
        u32DESOpMode = DES_MODE_CBC;
        break;
    case HWCRYPTO_TYPE_3DES_ECB:
        u32DESOpMode = TDES_MODE_ECB;
        break;
    case HWCRYPTO_TYPE_3DES_CBC:
        u32DESOpMode = TDES_MODE_CBC;
        break;
    default :
        return -RT_ERROR;
    }

    in = (unsigned char *)symmetric_info->in;
    out = (unsigned char *)symmetric_info->out;

